Revit 2026 API

# BuildingEnvelopeAnalyzer Class

---

Analyzes which elements are part of the building envelope, the building elements exposed to the outside.

SystemObject Autodesk.Revit.DB.AnalysisBuildingEnvelopeAnalyzer

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BuildingEnvelopeAnalyzer : IDisposable
```
```vb
Public Class BuildingEnvelopeAnalyzer
	Implements IDisposable
```
```cpp
public ref class BuildingEnvelopeAnalyzer : IDisposable
```
```fsharp
type BuildingEnvelopeAnalyzer =
    class
        interface IDisposable
    end
```

The BuildingEnvelopeAnalyzer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new analyzer. |
|  | Dispose | Releases all resources used by the BuildingEnvelopeAnalyzer |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundingElements | Returns the collection of building elements exposed to the outside forming the building envelope. |
|  | GetBoundingElementsForSpaceVolume | Returns the collection of bounding building elements for an enclosed space volume. |
|  | GetCenterPointsForConnectedGridCellsInSpaceVolume | Returns the collection of connected cells in an enclosed space volume. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class uses a combination of ray-casting and flood-fill algorithms in order to find the building elements that are exposed to the outside of the building. This method can also look for the bounding building elements for enclosed space volumes inside the building.

#### Reference

Autodesk.Revit.DB.Analysis Namespace